let curriculumObject = {
    "19-10-2018" : "Пара 4: Комп’ютерна графіка та мультимедіа (101)-Бойко Ю.П. (л) підгрупа 1; Пара 4: Об’єктно-орієнтоване програмування (307)- Духновська К.К. (л) підгрупа 2; Пара 5: Проектування та аналіз обчислювальних алгоритмів (217)-Домрачев В.М. (П); Пара 6: Об’єктно-орієнтоване програмування (307Б)-Духновська К.К. (л) підгрупа 2; Пара 6: Об’єктно-орієнтоване програмування (307А)-Галата Л.П. (л) підгрупа 1",
    "22-10-2018" : "Пара 3: Комп'ютерні мережі (307)-Сайко В.Г. (л) підгрупа 2; Пара 4: Комп'ютерні мережі (318)-Сайко В.Г. (Л); Пара 5: Об’єктно-орієнтоване програмування (318)-Корнієнко Б.Я. (Л)"
}

let curriculumObjectProperties = Object.keys(curriculumObject);

console.log(curriculumObject["25-11-2019"]);
